arduino/portentax8-stm32h7-fw/CM7/Core/Src/can.c
    /* USER CODE END FDCAN1_MspDeInit 1 */
  } else if (hfdcan->Instance == FDCAN2) {
    /* USER CODE BEGIN FDCAN2_MspDeInit 0 */

    /* USER CODE END FDCAN2_MspDeInit 0 */
    /* Peripheral clock disable */
    HAL_RCC_FDCAN_CLK_ENABLED--;
    if (HAL_RCC_FDCAN_CLK_ENABLED == 0) {
      __HAL_RCC_FDCAN_CLK_DISABLE();
    }

    /**FDCAN2 GPIO Configuration
    PB5     ------> FDCAN2_RX
    PB6     ------> FDCAN2_TX
    */
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_5 | GPIO_PIN_6);

    /* FDCAN2 interrupt DeInit */
    HAL_NVIC_DisableIRQ(FDCAN2_IT0_IRQn);
    /* USER CODE BEGIN FDCAN2_MspDeInit 1 */

    /* USER CODE END FDCAN2_MspDeInit 1 */
  }
}


static void error(char* string) {
    printf(string);
    while (1);
}

void fdcan1_handler(uint8_t opcode, uint8_t *data, uint16_t size) {
    if (opcode == CONFIGURE) {
        configureFDCAN(PERIPH_FDCAN1, data);
    } else if (opcode == CAN_FILTER) {
        uint32_t* info = (uint32_t*)data;
        CANFormat format = info[1] < 0x800 ? CANStandard : CANExtended;
        canFilter(PERIPH_FDCAN1, info[1], info[2], format, info[0]);
    } else {
        CAN_Message msg;
        msg.type = CANData;
        msg.format = CANStandard;
        memcpy(&msg, data, size);

        dbg_printf("Sending CAN message to %x, size %d, content[0]=0x%02X\n",
        msg.id, msg.len, msg.data[0]);

        if (msg.id > 0x7FF) {
        msg.format = CANExtended;
        }

        int ret = canWrite(PERIPH_FDCAN1, msg, 0);
        if (ret == 0) {
        canReset(PERIPH_FDCAN1);
        }
    }
}

void fdcan2_handler(uint8_t opcode, uint8_t *data, uint16_t size) {
    if (opcode == CONFIGURE) {
        configureFDCAN(PERIPH_FDCAN2, data);
    } else if (opcode == CAN_FILTER) {
        uint32_t* info = (uint32_t*)data;
        CANFormat format = info[1] < 0x800 ? CANStandard : CANExtended;
        canFilter(PERIPH_FDCAN2, info[1], info[2], format, info[0]);
    } else {
        CAN_Message msg;
        msg.type = CANData;
        msg.format = CANStandard;
        memcpy(&msg, data, size);

        dbg_printf("Sending CAN message to %x, size %d, content[0]=0x%02X\n",
        msg.id, msg.len, msg.data[0]);

        if (msg.id > 0x7FF) {
        msg.format = CANExtended;
        }

        int ret = canWrite(PERIPH_FDCAN2, msg, 0);
        if (ret == 0) {
        canReset(PERIPH_FDCAN2);
        }
    }
}


void canInit()
{
    can_init_freq_direct(&fdcan_1, CAN_1, 800000);
    can_init_freq_direct(&fdcan_2, CAN_2, 800000);

    register_peripheral_callback(PERIPH_FDCAN1, &fdcan1_handler);
    register_peripheral_callback(PERIPH_FDCAN2, &fdcan2_handler);

/*
    HAL_FDCAN_Start(&hfdcan1);
    HAL_FDCAN_Start(&hfdcan2);

    HAL_FDCAN_ActivateNotification(&hfdcan1, FDCAN_IT_RX_FIFO0_NEW_MESSAGE, 0);
    HAL_FDCAN_ActivateNotification(&hfdcan2, FDCAN_IT_RX_FIFO0_NEW_MESSAGE, 0);
  */
}

int canWrite(uint8_t peripheral, CAN_Message msg, int cc)
{
    if (peripheral == PERIPH_FDCAN1) {
        return can_write(&fdcan_1, msg, cc);
    }
    if (peripheral == PERIPH_FDCAN2) {
        return can_write(&fdcan_2, msg, cc);
    }
    return 0;
}

int canRead(uint8_t peripheral, CAN_Message *msg, int handle)
{
    if (peripheral == PERIPH_FDCAN1) {
        return can_read(&fdcan_1, msg, handle);
    }
    if (peripheral == PERIPH_FDCAN2) {
        return can_read(&fdcan_2, msg, handle);
    }
    return 0;
}

int canFilter(uint8_t peripheral, uint32_t id, uint32_t mask, CANFormat format, int32_t handle)
{
    if (peripheral == PERIPH_FDCAN1) {
        return can_filter(&fdcan_1, id, mask, format, handle);
    }
    if (peripheral == PERIPH_FDCAN2) {
        return can_filter(&fdcan_2, id, mask, format, handle);
    }
    return 0;
}

void canReset(uint8_t peripheral)
{
    if (peripheral == PERIPH_FDCAN1) {
        can_reset(&fdcan_1);
    }
    if (peripheral == PERIPH_FDCAN2) {
        can_reset(&fdcan_2);
    }
}

void can_handle_data() {
    CAN_Message msg;
    if (can_read(&fdcan_1, &msg, 0)) {
      enqueue_packet(PERIPH_FDCAN1, DATA, sizeof(msg), &msg);
    }

    if (can_read(&fdcan_2, &msg, 0)) {
      enqueue_packet(PERIPH_FDCAN2, DATA, sizeof(msg), &msg);
    }
}

void configureFDCAN(uint8_t peripheral, void* data) {

  if (peripheral == PERIPH_FDCAN1) {
    can_frequency(&fdcan_1, *((uint32_t*)data));
  } else {
    can_frequency(&fdcan_2, *((uint32_t*)data));
  }

  dbg_printf("Configuring fdcan%d with frequency %d\n", peripheral == PERIPH_FDCAN1 ? 1 : 2, *((uint32_t*)data));

  //HAL_FDCAN_ConfigFilter(&_hfdcan1, filterDef);
  //HAL_FDCAN_ConfigGlobalFilter(&_hfdcan1, nonMatchingStd, nonMatchingExt, rejectRemoteStd, rejectRemoteExt);
}

/** Call all the init functions
 *
 *  @returns
 *    0 if mode change failed or unsupported,
 *    1 if mode change was successful
 */
int can_internal_init(can_t *obj)
{
    if (HAL_FDCAN_Init(&obj->CanHandle) != HAL_OK) {
        error("HAL_FDCAN_Init error\n");
    }

    if (can_filter(obj, 0, 0, CANStandard, 0) == 0) {
        error("can_filter error\n");
    }

    if (can_filter(obj, 0, 0, CANExtended, 0) == 0) {
        error("can_filter error\n");
    }

    if (HAL_FDCAN_ConfigGlobalFilter(&obj->CanHandle, FDCAN_REJECT, FDCAN_REJECT, FDCAN_FILTER_REMOTE, FDCAN_FILTER_REMOTE) != HAL_OK) {
        error("HAL_FDCAN_ConfigGlobalFilter error\n");
    }

    if (HAL_FDCAN_Start(&obj->CanHandle) != HAL_OK) {
        error("HAL_FDCAN_Start error\n");
    }

    return 1;
}

void can_init_freq_direct(can_t *obj, CANName peripheral, int hz)
{
#if defined(__HAL_RCC_FDCAN1_CLK_ENABLE)
    __HAL_RCC_FDCAN1_CLK_ENABLE();
#else
    __HAL_RCC_FDCAN_CLK_ENABLE();
#endif

    if (peripheral == CAN_1) {
        obj->index = 0;
    }
#if defined(FDCAN2_BASE)
    else if (peripheral == CAN_2) {
        obj->index = 1;
    }
#endif

#if 0
    // Select PLL2Q as source of FDCAN clock
    RCC_PeriphCLKInitTypeDef RCC_PeriphClkInit;
#if (defined RCC_PERIPHCLK_FDCAN1)
    RCC_PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_FDCAN1;
    RCC_PeriphClkInit.Fdcan1ClockSelection = RCC_FDCAN1CLKSOURCE_PLL1;
#else
    RCC_PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_FDCAN;
    RCC_PeriphClkInit.FdcanClockSelection = RCC_FDCANCLKSOURCE_PLL2;
#endif
#if defined(DUAL_CORE) && (TARGET_STM32H7)
    while (LL_HSEM_1StepLock(HSEM, CFG_HW_RCC_SEMID)) {
    }
#endif /* DUAL_CORE */
    if (HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphClkInit) != HAL_OK) {
        error("HAL_RCCEx_PeriphCLKConfig error\n");
    }
#if defined(DUAL_CORE) && (TARGET_STM32H7)
    LL_HSEM_ReleaseLock(HSEM, CFG_HW_RCC_SEMID, HSEM_CR_COREID_CURRENT);
#endif /* DUAL_CORE */

#endif

    // Default values
    obj->CanHandle.Instance = (FDCAN_GlobalTypeDef *)peripheral;

    /* Bit time parameter
                                ex with 100 kHz   requested frequency hz
    fdcan_ker_ck               | 10 MHz         | 10 MHz
    Prescaler                  | 1              | 1
    Time_quantum (tq)          | 100 ns         | 100 ns
    Bit_rate                   | 0.1 MBit/s     | <hz>
    Bit_length                 | 10 µs = 100 tq | <n_tq> = 10 000 000 / <hz>
    Synchronization_segment    | 1 tq           | 1 tq
    Phase_segment_1            | 69 tq          | <nts1> = <n_tq> * 0.75
    Phase_segment_2            | 30 tq          | <nts2> = <n_tq> - 1 - <nts1>
    Synchronization_Jump_width | 30 tq          | <nsjw> = <nts2>
    */

#if (defined RCC_PERIPHCLK_FDCAN1)
    int ntq = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_FDCAN1) / hz;
#else
    int ntq = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_FDCAN) / hz;
#endif

    int nominalPrescaler = 1;
    // !When the sample point should be lower than 50%, this must be changed to
    // !IS_FDCAN_NOMINAL_TSEG2(ntq/nominalPrescaler), since
    // NTSEG2 and SJW max values are lower. For now the sample point is fix @75%
    while (!IS_FDCAN_NOMINAL_TSEG1(ntq / nominalPrescaler)) {
        nominalPrescaler ++;
        if (!IS_FDCAN_NOMINAL_PRESCALER(nominalPrescaler)) {
            error("Could not determine good nominalPrescaler. Bad clock value\n");
        }
    }
    ntq = ntq / nominalPrescaler;

